# Rpstr_GetValueInt

## Description
Get an integer value from the VectorScript value repository.

```pascal
FUNCTION Rpstr_GetValueInt(
				name         : STRING;
				defaultValue : INTEGER) : INTEGER;
```

```python

def vs.Rpstr_GetValueInt(name, defaultValue):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|name|STRING|The name of the value.|
|defaultValue|INTEGER|Default value if the name does not exist in the VectorScript value repository.|

## See Also
VS Functions:
Rpstr_RemoveValues| Rpstr_RemoveValue| Rpstr_GetValueBool| Rpstr_SetValueBool| Rpstr_GetValueInt| Rpstr_SetValueInt| Rpstr_GetValueReal| Rpstr_SetValueReal| Rpstr_GetValueStr| Rpstr_SetValueStr

## Version
Availability: from Vectorworks 2012
## Category
* Utility